In [18]:
# 패키지 임포트
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

import numpy as np
import pandas as pd

In [19]:
# seaborn 패키지의 titanic 데이터셋을 load 하시오
# 타이타익 승객 데이터 로드
import seaborn as sns # 그래프 패키지

titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

#### 연습문제 1
- 타이타닉 호 승객에 대해서, 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive)인원수를 구하시오.

- 성별 인원수는 인덱스 기준으로 정렬하고
- 나이별 인원수는 값 기준 정렬
- 그 나머지는 임의 기준 정렬 하시오.

In [20]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [21]:
# 성별(sex) 인원수, 인덱스 기준으로 정렬
titanic['sex'].value_counts().sort_index()

female    314
male      577
Name: sex, dtype: int64

In [22]:
# 나이별(age) 인원수, 나이별 인원수는 값 기준 정렬
titanic['age'].value_counts().sort_values()

74.00     1
34.50     1
0.42      1
0.67      1
66.00     1
         ..
28.00    25
19.00    25
18.00    26
22.00    27
24.00    30
Name: age, Length: 88, dtype: int64

In [23]:
# 선실별(class) 인원수
titanic['class'].value_counts().sort_index(ascending=False)

# 주의!
# 컬럼에 접근시 . 이용해서 접근가능
titanic.sex.value_counts()
# 파이썬에서는 형태분류 class라는 객체이름 사용 - 예약어
type(titanic.iloc[0,0]) # numpy.int64
# titanic.class.value_counts() # SyntaxError: invalid syntax
# class는 컬럼명은 예약어이므로 . 연산자 접근 불가능

Third     491
Second    184
First     216
Name: class, dtype: int64

male      577
female    314
Name: sex, dtype: int64

numpy.int64

In [24]:
# 사망/생존(alive)인원수
titanic.alive.value_counts().sort_values(ascending=False)
titanic['alive'].value_counts().sort_values(ascending=False)

no     549
yes    342
Name: alive, dtype: int64

no     549
yes    342
Name: alive, dtype: int64

In [25]:
# 위에 코드 한번에 해결
cols = 'sex','age','class','alive'
v_count = {}

for col in cols :
    v_count[col] = titanic[col].value_counts()
    
v_count

{'sex': male      577
 female    314
 Name: sex, dtype: int64,
 'age': 24.00    30
 22.00    27
 18.00    26
 19.00    25
 28.00    25
          ..
 36.50     1
 55.50     1
 0.92      1
 23.50     1
 74.00     1
 Name: age, Length: 88, dtype: int64,
 'class': Third     491
 First     216
 Second    184
 Name: class, dtype: int64,
 'alive': no     549
 yes    342
 Name: alive, dtype: int64}

#### 연습문제 2
- 성별에 따른 생존자수와 사망자수의 정보를 갖고 있는 데이터프레임 titanic_y_n 를 생성하시오
    - 0은 생존 1은 사망

![](데이터조작문제.PNG)

In [26]:
# 사망자 생존자 data분리
no = titanic[titanic.alive=='no']
yes = titanic[titanic.alive=='yes']

no_s = no.sex.value_counts()
yes_s = yes.sex.value_counts()

pd.DataFrame([no_s, yes_s], index=[0,1])

   male  female
0   468      81
1   109     233

In [27]:
titanic_y_n = pd.DataFrame(titanic.loc[:,['sex','alive']]).value_counts() # df형식으로 바꿈
titanic_y_n

sex     alive
male    no       468
female  yes      233
male    yes      109
female  no        81
dtype: int64

In [28]:
# pd.pivot_table(titanic_y_n, index=['alive'],columns=['sex']) # 'Series' object has no attribute 'columns'????

AttributeError: 'Series' object has no attribute 'columns'

In [29]:
# 내가 한 코드
titanic_y_n = pd.DataFrame(titanic[['sex','survived']].value_counts())
titanic_y_n

                   0
sex    survived
male   0         468
female 1         233
male   1         109
female 0          81

#### 연습문제
- 타이타닉호 승객을 사망자와 생존자 그룹으로 나누고(alive)
- 각 그룹에 대해 미성년자, 청년, 중년, 장년, 노년 승객의 비율을 구하시오.
    - bins=[1,15,25,35,60,99]
    - labels=['미성년자','청년','중년','장년','노년']
    - 각 그룹별 비유의 전체 합은 1이 되어야 한다.

In [30]:
# 사망자와 생존자 그룹으로 데이터프레임 추출
no = titanic[titanic.alive=='no']
yes = titanic[titanic.alive=='yes']

In [31]:
# 라벨과 범위 간격 설정
labels=['미성년자','청년','중년','장년','노년']

In [33]:
# bins=[1,15,25,35,60,99]

# bins의 범위 유효성 검사
np.min(titanic.age) # 0.42 -> 최소 범위 1로 시작하면 모든 나이가 포함되지 않음
np.max(titanic.age) # 80.0

bins=[0,15,25,35,60,99]

0.42

80.0

In [34]:
# 카테고리 데이터 생성
no['age_cut'] = pd.cut(no['age'],bins,labels=labels)
no['age_cut'] = pd.cut(yes['age'],bins,labels=labels)

<ipython-input-34-6041af0b15b9>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  no['age_cut'] = pd.cut(no['age'],bins,labels=labels)
<ipython-input-34-6041af0b15b9>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  no['age_cut'] = pd.cut(yes['age'],bins,labels=labels)

In [35]:
no.head(1)
yes.head(1)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_cut
0,0,3,male,22.0,1,0,7.25,S,Third,man,True,NaN,Southampton,no,False,NaN

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [ ]:
# 카테고리 데이터들의 빈도수 계산
no['age_cut'].value_counts()
yes['age_cut'].value_counts()

In [ ]:
no['age_cut'].value_counts(normalize=True)
yes['age_cut'].value_counts(normalize=True)
yes['age_cut'].value_counts(normalize=True).sum()

In [ ]:
# 내가 한 코드
# data : 구간 나눌 실제 값, bins : 구간 경계값, label: 카테고리값
data = titanic[['survived','age']]

bins=[1,15,25,35,60,99]
labels=['미성년자','청년','중년','장년','노년']

age = pd.cut(data['age'],bins,labels=labels)
age

In [ ]:
data['age']=age
data

data.value_counts(normalize=True).sort_index()

#### 연습문제
- ['id_1','id_2','id_3','id_4'] 와 같은 리스트 요소를
- 내포 for문을 이용해서 생성후 리스트로 추가하시오.

In [1]:
['id_'+str(i) for i in range(1,5)]

['id_1', 'id_2', 'id_3', 'id_4']

In [ ]:
# 내가 한 코드
# 고정문자열(id_)과 반복 요소(1,2,3,4)를  조합하는 코드를 내포  for문으로 만들어보세요


test=['id_' + str(i) for i in range(1,5) ]
test